//###########################################################################
//    __                    ____            __
//   / /  __ __ ___ _  __  / __/___  ____  /_/___  ____
//  / /__/ // /  _ \ \/ / / __/  _ \/ __ \/ /  _ \/  _/
//  \___/__, /__//_/_/\_\ \__/__//_/\__, /_/__//_/\__/
//      /___/                       /___/ 
// 
//  Copyright (C) 2003~2006 fallingCAT studios. All Rights Reserved.
//	URL : http://www.LynxEngine.net
//
//--------------------------------------------------------------------------
//
//  Best viewed with Tabs = 4.
//  Created by Owen Wu : 2004/07/27
//  Last Update : 
//
//###########################################################################

#include <LynxEngine_PCH.h>

#include <ScriptSystem/LynxScriptSystem.h>
#include <ScriptSystem/LynxScriptClass.h>
#include <ScriptSystem/LynxVMachine.h>
	
namespace LynxEngine 
{	
	namespace ScriptSystem 
	{
		//-------------------------------------------------------------------------------------------------------
		//
		//  說明:   
		//-------------------------------------------------------------------------------------------------------
		CScriptClass::CScriptClass(CVMachine* vm)		
		{			
			m_lpVMachine = vm;
			m_lpBaseClass = NULL;
		}
		//-------------------------------------------------------------------------------------------------------
		//
		//  說明:   
		//-------------------------------------------------------------------------------------------------------
		CScriptClass::~CScriptClass(void)
		{
			m_lpVMachine = NULL;		
		}												
	}
}